sergz72/ARM/mspm0g350x/ti/driverlib/dl_lcd.h
/*! @enum DL_LCD_BLINKING_MEMORY */
typedef enum {
    /*! Index to access LCD blink memory register 0 */
    DL_LCD_BLINKING_MEMORY_0 = 0,
    /*! Index to access LCD blink memory register 1 */
    DL_LCD_BLINKING_MEMORY_1 = 1,
    /*! Index to access LCD blink memory register 2 */
    DL_LCD_BLINKING_MEMORY_2 = 2,
    /*! Index to access LCD blink memory register 3 */
    DL_LCD_BLINKING_MEMORY_3 = 3,
    /*! Index to access LCD blink memory register 4 */
    DL_LCD_BLINKING_MEMORY_4 = 4,
    /*! Index to access LCD blink memory register 5 */
    DL_LCD_BLINKING_MEMORY_5 = 5,
    /*! Index to access LCD blink memory register 6 */
    DL_LCD_BLINKING_MEMORY_6 = 6,
    /*! Index to access LCD blink memory register 7 */
    DL_LCD_BLINKING_MEMORY_7 = 7,
    /*! Index to access LCD blink memory register 8 */
    DL_LCD_BLINKING_MEMORY_8 = 8,
    /*! Index to access LCD blink memory register 9 */
    DL_LCD_BLINKING_MEMORY_9 = 9,
    /*! Index to access LCD blink memory register 10 */
    DL_LCD_BLINKING_MEMORY_10 = 10,
    /*! Index to access LCD blink memory register 11 */
    DL_LCD_BLINKING_MEMORY_11 = 11,
    /*! Index to access LCD blink memory register 12 */
    DL_LCD_BLINKING_MEMORY_12 = 12,
    /*! Index to access LCD blink memory register 13 */
    DL_LCD_BLINKING_MEMORY_13 = 13,
    /*! Index to access LCD blink memory register 14 */
    DL_LCD_BLINKING_MEMORY_14 = 14,
    /*! Index to access LCD blink memory register 15 */
    DL_LCD_BLINKING_MEMORY_15 = 15,
    /*! Index to access LCD blink memory register 16 */
    DL_LCD_BLINKING_MEMORY_16 = 16,
    /*! Index to access LCD blink memory register 17 */
    DL_LCD_BLINKING_MEMORY_17 = 17,
    /*! Index to access LCD blink memory register 18 */
    DL_LCD_BLINKING_MEMORY_18 = 18,
    /*! Index to access LCD blink memory register 19 */
    DL_LCD_BLINKING_MEMORY_19 = 19,
    /*! Index to access LCD blink memory register 20 */
    DL_LCD_BLINKING_MEMORY_20 = 20,
    /*! Index to access LCD blink memory register 21 */
    DL_LCD_BLINKING_MEMORY_21 = 21,
    /*! Index to access LCD blink memory register 22 */
    DL_LCD_BLINKING_MEMORY_22 = 22,
    /*! Index to access LCD blink memory register 23 */
    DL_LCD_BLINKING_MEMORY_23 = 23,
    /*! Index to access LCD blink memory register 24 */
    DL_LCD_BLINKING_MEMORY_24 = 24,
    /*! Index to access LCD blink memory register 25 */
    DL_LCD_BLINKING_MEMORY_25 = 25,
    /*! Index to access LCD blink memory register 26 */
    DL_LCD_BLINKING_MEMORY_26 = 26,
    /*! Index to access LCD blink memory register 27 */
    DL_LCD_BLINKING_MEMORY_27 = 27,
    /*! Index to access LCD blink memory register 28 */
    DL_LCD_BLINKING_MEMORY_28 = 28,
    /*! Index to access LCD blink memory register 29 */
    DL_LCD_BLINKING_MEMORY_29 = 29,
    /*! Index to access LCD blink memory register 30*/
    DL_LCD_BLINKING_MEMORY_30 = 30,
    /*! Index to access LCD blink memory register 31 */
    DL_LCD_BLINKING_MEMORY_31 = 31,
} DL_LCD_BLINKING_MEMORY;

/*! @enum DL_LCD_COM */
typedef enum {
    /*! Index to access COM 0 */
    DL_LCD_COM_0 = 0x01,
    /*! Index to access COM 1 */
    DL_LCD_COM_1 = 0x02,
    /*! Index to access COM 2 */
    DL_LCD_COM_2 = 0x04,
    /*! Index to access COM 3 */
    DL_LCD_COM_3 = 0x08,
    /*! Index to access COM 4 */
    DL_LCD_COM_4 = 0x10,
    /*! Index to access COM 5 */
    DL_LCD_COM_5 = 0x20,
    /*! Index to access COM 6 */
    DL_LCD_COM_6 = 0x40,
    /*! Index to access COM 7 */
    DL_LCD_COM_7 = 0x80,
} DL_LCD_COM;

/*! @enum DL_LCD_VREFGEN_CYCLES */
typedef enum {
    /*! Turn on VREF generation circuitry for 16 clock cycles */
    DL_LCD_VREFGEN_CYCLES_16 = LCD_LCDVREFCFG_ONTIME_ONTIME16,
    /*! Turn on VREF generation circuitry for 32 clock cycles */
    DL_LCD_VREFGEN_CYCLES_32 = LCD_LCDVREFCFG_ONTIME_ONTIME32,
    /*! Turn on VREF generation circuitry for 128 clock cycles */
    DL_LCD_VREFGEN_CYCLES_128 = LCD_LCDVREFCFG_ONTIME_ONTIME128,
    /*! Turn on VREF generation circuitry for 256 clock cycles */
    DL_LCD_VREFGEN_CYCLES_256 = LCD_LCDVREFCFG_ONTIME_ONTIME256,
} DL_LCD_VREFGEN_CYCLES;

/**
 * @brief Configuration struct for @ref DL_LCD_init
 */
typedef struct {
    /*! The frequency divider to set. One of @ref DL_LCD_FREQ_DIVIDE */
    DL_LCD_FREQ_DIVIDE frequencyDivider;
    /*! The mux rate. One of @ref DL_LCD_MUX_RATE. */
    DL_LCD_MUX_RATE muxRate;
    /*! Select waveforms power mode. One of @ref DL_LCD_WAVEFORM_POWERMODE */
    DL_LCD_WAVEFORM_POWERMODE lowPowerWaveform;
} DL_LCD_Config;

/**
 *  @brief Initialize the LCD peripheral
 *
 *  Initializes all the common configurable options for the LCD peripheral. Any
 *  other custom configuration can be done after calling this API. The LCD is
 *  not enabled in this API.
 *
 *  @param[in] lcd      Pointer to the register overlay for the peripheral
 *  @param[in] config   Configuration for LCD peripheral
 */
void DL_LCD_init(LCD_Regs *lcd, DL_LCD_Config *config);

/**
 *  @brief Enable a pin as LCD function
 *
 *  @param[in] lcd      Pointer to the register overlay for the peripheral
 *  @param[in] pin      Pin to set as LCD function
 *                      One of @ref DL_LCD_SEGMENT_LINE
 *  @note               This function will disable power to the LCD module.
 *                      If needed, enable the module after by calling
 *                      @ref DL_LCD_enable
 */

void DL_LCD_setPinAsLCDFunction(LCD_Regs *lcd, uint32_t pin);

/**
 *  @brief Enable a pin as port function
 *
 *  @param[in] lcd      Pointer to the register overlay for the peripheral
 *  @param[in] pin      Pin to set as port function.
 *                      One of @ref DL_LCD_SEGMENT_LINE
 *  @note               This function will disable power to the LCD module.
 *                      If needed, enable the module after by calling
 *                      @ref DL_LCD_enable
 */
void DL_LCD_setPinAsPortFunction(LCD_Regs *lcd, uint8_t pin);

/**
 *  @brief Enable an LCD function pin as COM
 *
 *  @param[in] lcd      Pointer to the register overlay for the peripheral
 *  @param[in] pin      Pin to set as common.
 *                      One of @ref DL_LCD_SEGMENT_LINE
 *  @param[in] com      The selected COM number for the common line.
 *                      One of @ref DL_LCD_COM
 */
void DL_LCD_setPinAsCommon(LCD_Regs *lcd, uint8_t pin, uint32_t com);

/**
 *  @brief Enable an LCD function pin as Segment
 *
 *  @param[in] lcd      Pointer to the register overlay for the peripheral
 *  @param[in] pin      Pin to set as segment line.
 *                      One of @ref DL_LCD_SEGMENT_LINE
 */
void DL_LCD_setPinAsSegment(LCD_Regs *lcd, uint8_t pin);

/**
 *  @brief Enables power to the LCD module
 *
 *  @param[in] lcd  Pointer to the register overlay for the peripheral
 *
 */
__STATIC_INLINE void DL_LCD_enablePower(LCD_Regs *lcd)
{
    lcd->PWREN |= (LCD_PWREN_KEY_UNLOCK_W | LCD_PWREN_ENABLE_ENABLE);
}

/**
 * @brief Disables power to the LCD module
 *
 * @param lcd   Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_LCD_disablePower(LCD_Regs *lcd)
{
    lcd->PWREN = (LCD_PWREN_KEY_UNLOCK_W | LCD_PWREN_ENABLE_DISABLE);
}

/**
 *  @brief Checks if power module on LCD is enabled
 *
 *  @param[in]  lcd  Pointer to the register overlay for the peripheral
 *
 *  @return     If power module on LCD is enabled
 *
 *  @retval     true if power module on LCD is enabled
 *  @retval     false if power module on LCD is disabled
 */
__STATIC_INLINE bool DL_LCD_isPowerEnabled(LCD_Regs *lcd)
{
    return ((lcd->PWREN & LCD_PWREN_ENABLE_MASK) ==
            LCD_PWREN_ENABLE_ENABLE);
}

/**
 *  @brief Resets LCD peripheral
 *
 *  @param[in] lcd  Pointer to the register overlay for the peripheral
 *
 */
__STATIC_INLINE void DL_LCD_reset(LCD_Regs *lcd)
{
    lcd->RSTCTL = (LCD_RSTCTL_KEY_UNLOCK_W | LCD_RSTCTL_RESETSTKYCLR_CLR |
            LCD_RSTCTL_RESETASSERT_ASSERT);
}

/**
 *  @brief Checks if LCD peripheral was reset
 *
 *  @param[in]  lcd  Pointer to the register overlay for the peripheral
 *
 *  @return     If peripheral was reset
 *
 *  @retval     true if peripheral was reset since this bit was last cleared by
 *              RESETSTKYCLR in the RSTCTL register
 *  @retval     false if peripheral was not reset since the last bit clear
 */
__STATIC_INLINE bool DL_LCD_isReset(LCD_Regs *lcd)
{
    return ((lcd->STAT & LCD_STAT_RESETSTKY_MASK) ==
            LCD_STAT_RESETSTKY_RESET);
}

/**
 *  @brief Get the event line mode
 *
 *  @param[in]  lcd  Pointer to the register overlay for the peripheral
 *
 *  @return     event line mode
 *
 *  @retval     One of @ref DL_LCD_EVENT_LINE_MODE
 */
__STATIC_INLINE DL_LCD_EVENT_LINE_MODE DL_LCD_getEventLineMode(LCD_Regs *lcd)
{
    uint32_t eventLineMode = (lcd->EVT_MODE & LCD_EVT_MODE_INT0_CFG_MASK);

    return (DL_LCD_EVENT_LINE_MODE)(eventLineMode);
}

/**
 *  @brief Gets the highest priority pending interrupt
 *
 *  Accesses and reads the IIDX register to obtain the highest currently
 *  pending interrupt. A read clears the corresponding interrupt flag in RIS
 *  and MIS.
 *
 *  @param[in]  lcd  pointer to the register overlay of the peripheral
 *
 *  @return     The highest priority pending interrupt
 *
 *  @retval     One of @ref DL_LCD_IIDX
 */
__STATIC_INLINE DL_LCD_IIDX DL_LCD_getPendingInterrupt(LCD_Regs *lcd)
{
    return ((DL_LCD_IIDX) lcd->INT_EVENT0.IIDX);
}

/**
 *  @brief Enable LCD interrupts
 *
 *  @param[in] lcd              Pointer to the register overlay for the
 *                              peripheral
 *  @param[in] interruptMask    Bit mask of interrupts to enable. Bitwise OR of
 *                              @ref DL_LCD_INTERRUPT.
 */
__STATIC_INLINE void DL_LCD_enableInterrupt(
    LCD_Regs *lcd, uint32_t interruptMask)
{
    lcd->INT_EVENT0.IMASK |= interruptMask;
}

/**
 *  @brief Disable LCD interrupts
 *
 *  @param[in] lcd              Pointer to the register overlay for the
 *                              peripheral
 *  @param[in] interruptMask    Bit mask of interrupts to disable. Bitwise OR of
 *                              @ref DL_LCD_INTERRUPT.
 */
__STATIC_INLINE void DL_LCD_disableInterrupt(
    LCD_Regs *lcd, uint32_t interruptMask)
{
    lcd->INT_EVENT0.IMASK &= ~(interruptMask);
}

/**
 *  @brief Check which LCD interrupts are enabled
 *
 *  @param[in]  lcd             Pointer to the register overlay for the
 *                              peripheral
 *  @param[in]  interruptMask   Bit mask of interrupts to check. Bitwise OR of
 *                              @ref DL_LCD_INTERRUPT.
 *
 *  @return     Which of the requested LCD interrupts are enabled
 *
 *  @retval     Bitwise OR of @ref DL_LCD_INTERRUPT values
 */
__STATIC_INLINE uint32_t DL_LCD_getEnabledInterrupts(
    LCD_Regs *lcd, uint32_t interruptMask)
{
    return (lcd->INT_EVENT0.IMASK & interruptMask);
}

/**
 *  @brief Check interrupt flag of any LCD interrupt
 *
 *  Checks if any of the LCD interrupts are pending. Interrupts do not have to
 *  be previously enabled.
 *
 *  @param[in]  lcd             Pointer to the register overlay for the
 *                              peripheral
 *  @param[in]  interruptMask   Bit mask of interrupts to check. Bitwise OR of
 *                              @ref DL_LCD_INTERRUPT.
 *
 *  @return     Which of the requested LCD interrupts are pending
 *
 *  @retval     Bitwise OR of @ref DL_LCD_INTERRUPT values
 */
__STATIC_INLINE uint32_t DL_LCD_getRawInterruptStatus(
    LCD_Regs *lcd, uint32_t interruptMask)
{
    return (lcd->INT_EVENT0.RIS & interruptMask);
}

/**
 *  @brief Check interrupt flag of enabled LCD interrupts
 *
 *  Checks if any of the LCD interrupts that were previously enabled are
 *  pending.
 *
 *  @param[in]  lcd             Pointer to the register overlay for the
 *                              peripheral
 *  @param[in]  interruptMask   Bit mask of interrupts to check. Bitwise OR of
 *                              @ref DL_LCD_INTERRUPT.
 *
 *  @return     Which of the requested LCD interrupts are pending
 *
 *  @retval     Bitwise OR of @ref DL_LCD_INTERRUPT values
 *
 *  @sa         DL_LCD_enableInterrupt
 */
__STATIC_INLINE uint32_t DL_LCD_getEnabledInterruptStatus(
    LCD_Regs *lcd, uint32_t interruptMask)
{
    return (lcd->INT_EVENT0.MIS & interruptMask);
}

/**
 *  @brief Set LCD interrupts
 *
 *  @param[in] lcd              Pointer to the register overlay for the
 *                              peripheral
 *  @param[in] interruptMask    Bit mask of interrupts to set. Bitwise OR of
 *                              @ref DL_LCD_INTERRUPT.
 */
__STATIC_INLINE void DL_LCD_setInterrupts(
    LCD_Regs *lcd, uint32_t interruptMask)
{
    lcd->INT_EVENT0.ISET = interruptMask;
}

/**
 *  @brief Clear pending LCD interrupts
 *
 *  @param[in] lcd              Pointer to the register overlay for the
 *                              peripheral
 *  @param[in] interruptMask    Bit mask of interrupts to clear. Bitwise OR of
 *                              @ref DL_LCD_INTERRUPT.
 */
__STATIC_INLINE void DL_LCD_clearInterruptStatus(
    LCD_Regs *lcd, uint32_t interruptMask)
{
    lcd->INT_EVENT0.ICLR = interruptMask;
}

/**
 *  @brief Enable external synchronization
 *
 *  @param[in] lcd  Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_LCD_enableExternalSync(LCD_Regs *lcd)
{
    lcd->LCDCTL0 |= LCD_LCDCTL0_LCDSYNCEXT_LCD_EXT_SYNC_ON;
}

/**
 *  @brief Disable external synchronization
 *
 *  @param[in] lcd  Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_LCD_disableExternalSync(LCD_Regs *lcd)
{
    lcd->LCDCTL0 &= ~(LCD_LCDCTL0_LCDSYNCEXT_MASK);
}

/**
 *  @brief Checks if external synchronization is enabled
 *
 *  @param[in]  lcd  Pointer to the register overlay for the peripheral
 *
 *  @return     If external synchronization is enabled
 *
 *  @retval     true if external synchronization enabled
 *  @retval     false if external synchronization is disabled
 */
__STATIC_INLINE bool DL_LCD_isExternalSyncEnabled(LCD_Regs *lcd)
{
    return ((lcd->LCDCTL0 & LCD_LCDCTL0_LCDSYNCEXT_MASK) ==
            LCD_LCDCTL0_LCDSYNCEXT_LCD_EXT_SYNC_ON);
}

/**
 *  @brief Set the LCD frequency divider.
 *
 *  fLCD = fSOURCE / ((LCDDIVx + 1) × Value[LCDMXx])
 *
 *  @param[in]  lcd     Pointer to the register overlay for the peripheral
 *  @param[in]  fDiv    The frequency divider to set.
 *                      One of @ref DL_LCD_FREQ_DIVIDE
 *
 *  @pre        The LCD module must be off (LCDCTL0.LCDON == 0) before setting
 *              this configuration.
 */
__STATIC_INLINE void DL_LCD_setFreqDiv(
    LCD_Regs *lcd, DL_LCD_FREQ_DIVIDE fDiv)
{
    DL_Common_updateReg(
        &lcd->LCDCTL0, (uint32_t) fDiv, LCD_LCDCTL0_LCDDIVX_MASK);
}

/**
 *  @brief Get the LCD frequency divider
 *
 *  @param[in]  lcd     Pointer to the register overlay for the peripheral
 *
 *  @return     The current frequency divider
 *
 *  @retval     One of @ref DL_LCD_FREQ_DIVIDE
 */
__STATIC_INLINE DL_LCD_FREQ_DIVIDE DL_LCD_getFreqDiv(LCD_Regs *lcd)
{
    uint32_t fDiv = (lcd->LCDCTL0 & LCD_LCDCTL0_LCDDIVX_MASK);

